;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! academic-phrases     :pin "25d9cf67feac6359cb213f061735e2679c84187f")
(package! avy-flycheck         :pin "5522f3bbbed1801d9278ed696ec0cbba38352985")
(package! auto-yasnippet       :pin "6a9e406d0d7f9dfd6dff7647f358cb05a0b1637e")
(package! company-math         :pin "3eb006874e309ff4076d947fcbd61bb6806aa508")
(package! d2-mode              :pin "cbe7b16141bd80fe4344f0403e61fd7ee4e0fd89" :recipe (:host github :repo "andorsk/d2-mode"))
(package! evil-tex             :pin "3e0a26b91a1a56b0f35cbd450d01431057551750")
(package! flycheck-grammalecte :pin "68c5087c8b31cf10fb9df77478edd24200fb4108")
(package! just-mode            :pin "45a221063093f3461816913acdaba898e62b42ce")
(package! literate-calc-mode   :pin "900bdd12c0a6e6874f60b0df99a72fd329873ea1")
(package! magit-delta          :pin "5fc7dbddcfacfe46d3fd876172ad02a9ab6ac616")
(package! matlab-mode          :pin "4cf540990f1f568c513162a0103b2b00c3d1ae43")
(package! scad-mode            :pin "e2477ebebcdd21d8c8394f2dffb551fadbfdff53")
(package! scad-preview         :pin "c5449b26c63f3e0a695905a7e4e84f8d844f761b")
(package! string-inflection    :pin "50ad54970b3cc79b6b83979bde9889ad9a9e1a9c")
(package! systemd              :pin "8742607120fbc440821acbc351fda1e8e68a8806")
(package! wgsl-mode            :pin "e7856d6755d93e40ed74598a68ef5f607322618b")
(package! tiny                 :pin "c107480fca7e42737c51b2afaa33ac31e92a7290")
