(package! citeproc                                                                                 :pin "2623043b2546ee09a4bd86641870ca86332c0bcf")
(package! citeproc-org                                                                             :pin "840e352855704921e2e68065e9abfdba769ccbd1")
(package! lazytab         :recipe (:host github :repo "karthink/lazytab")                          :pin "2cf748286700ffa8a41999ad171d7bf9d586e12f")
;; (package! nano-emacs      :recipe (:host github :repo "rougier/nano-emacs")                        :pin "b8631088220dbbcd885ad1353bdc52b569655f85")
(package! org-auctex      :recipe (:host github :repo "karthink/org-auctex")                       :pin "e1271557b9f36ca94cabcbac816748e7d0dc989c")
(package! org-bullets                                                                              :pin "767f55feb58b840a5a04eabfc3fbbf0d257c4792")
(package! org-modern                                                                               :pin "2ab56bdf6dda272a0b7655fb45a2f3f7cd0feb81")
(package! org-re-reveal-citeproc                                                                   :pin "faa9ea387917b20bd1499ad90199ff3d417c00c2")
(package! org-ref                                                                                  :pin "1af17e6df1a8ad967352edff0223cd8d3cf55836")
(package! org-super-links :recipe (:host github :repo "toshism/org-super-links" :branch "develop") :pin "0dd9ed22b4785f50c61051170db7c78b522a37ee")
(package! org-transclusion                                                                         :pin "37b5bc30c7662f7bdcdfa5ffaaf6963f1432f012")
(package! valign                                                                                   :pin "c9d30a31002cd296f2ea7398ca86ae9f48553467")
